Revit 2027 API
SpatialFieldManager.GetResultSchema Method
 Returns result schema by index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisResultSchema GetResultSchema(
	int idx
)
Public Function GetResultSchema (
	idx As Integer
) As AnalysisResultSchema
public:
AnalysisResultSchema^ GetResultSchema(
	int idx
)
member GetResultSchema :
        idx : int -> AnalysisResultSchema
Parameters
idx Int32
 Index of registered result schema
Return Value
AnalysisResultSchema
Exceptions
Exception | Condition
ArgumentException |  idx refers to non-existent result schema
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace